# FabricationItemFolder Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FabricationItemFolder Members
FabricationItemFolder Class Methods Properties See Also
---
The FabricationItemFolder type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the FabricationItemFolder |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetItemFiles | Gets the item files in this item folder. |
| GetSubFolders | Gets the item folder's sub folders. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The item folder's name. |

# See Also
FabricationItemFolder Class
Autodesk.Revit.DB Namespace